import psycopg2

# 数据库连接信息
pg_config2 = {
    'host': '172.18.31.230',
    'port': 5432,
    'dbname': 'ypm',
    'user': 'postgres',
    'password': 'postgres'
}

pg_config = {
    'host': '172.18.37.248',
    'port': 5432,
    'dbname': 'elss',
    'user': 'postgres',
    'password': 'postgres'
}

# station_name到station_id的映射字典
station_name_to_id = {
    "中电滨海风电": 102000008,
    "长江响水风电": 102000009,
    "广核射阳风电": 102000010,
    "国华弶港风电": 102000011,
    "中电大丰风电": 102000012,
    "国信东凌风电": 102000013,
    "国华东台风电": 102000014,
    "龙源大丰风电": 102000015,
    "华能如东风电": 102000016,
    "长江响海风电": 102000017,
    "龙源启东风电": 102000026,
    "华能启东风电": 102000027,
    "联能如东风电": 102000028,
    "华电灌云风电": 102000029,
    "龙源如海风电": 102000030,
    "龙源盱眙风电": 102000031,
    "华润如东风电": 102000032,
    "中水如东风电": 102000033,
    "国信临海风电": 102000034,
    "国华射阳风电": 102000035,
    "苏州康盛风电": 102000036,
    "龙源李埝风电": 102000037,
    "中电马陵风电": 102000038,
    "中电贾汪风电": 102000040,
    "泗洪协合风电": 102000041,
    "国信黄海风电": 102000042,
    "广核如海风电": 102000043,
    "高邮协合风电": 102000044,
    "广核洋马风电": 102000045,
    "中电二洪风电": 102000046,
    "华能铜山风电": 102000047,
    "华电滨海风电": 102000048,
    "国信大中风电": 102000049,
    "国信东台风电": 102000050,
    "广恒东台风电": 102000051,
    "华能六合风电": 102000052,
    "神华睢宁风电": 102000053,
    "银宝射阳风电": 102000054,
    "华电沙沟光伏": 102000055,
    "华电李中光伏": 102000056,
    "高邮振兴光伏": 102000057,
    "金湖振合光伏": 102000058,
    "天合响水光伏": 102000059,
    "金湖正辉光伏": 102000060,
    "舜大宝应光伏": 102000061,
    "亿晶直溪光伏": 102000062,
    "广核浦南光伏": 102000063,
    "华电仪征光伏": 102000064,
    "华海金湖光伏": 102000065,
    "常熟福山光伏": 102000066,
    "龙源黄海风电": 102000067,
    "高传天岗风电": 102000068,
    "龙源如东风电": 102000069,
    "华能如海风电": 102000070,
    "泗洪天岗光伏": 102000071,
    "广核特庸风电": 102000072,
    "龙源丰海风电": 102000073,
    "天润大丰风电": 102000074,
    "和风灌西风电": 102000185,
    "深能高邮风电": 102000186,
    "大唐三龙风电": 102000205,
    "龙源蒋海风电": 102000206,
    "深能邳州风电": 102000207,
    "亿晶殷庄光伏": 102000226,
    "华能太仓光伏": 102000228,
    "瀚宜杨巷光伏": 102000229,
    "通威龙袍光伏": 102000230,
    "华能仪征风电": 102000245,
    "九洲前黄光伏": 102000252,
    "上电亮海风电": 102000265,
    "中泗光伏五站": 102000266,
    "广泗光伏四站": 102000285,
    "通泗光伏三站": 102000286,
    "中电大有风电": 102000287,
    "三峡丰海风电": 102000305,
    "大唐滨海风电": 102000306,
    "广泗光伏二站": 102000307,
    "通泗光伏一站": 102000308,
    "国华华海风电": 102000325,
    "广核射阳湖光伏": 102000326,
    "广核柳堡光伏": 102000327,
    "鸿盛柳堡光伏": 102000328,
    "北控广洋湖光伏": 102000329,
    "中电射阳湖光伏": 102000330,
    "高传官滩风电": 102000331,
    "高传卢集风电": 102000332,
    "国和淮阴风电": 102000333,
    "新天盱眙风电": 102000334,
    "华能丰海风电": 102000335,
    "华润亭湖风电": 102000336,
    "国信灌云风电": 102000337,
    "广核黄沙港风电": 102000338,
    "融保达周山风电": 102000339,
    "融保达广洋风电": 102000340,
    "汇智淮阴风电": 102000341,
    "九思如海风电": 102000342,
    "盛东如海风电": 102000343,
    "聚能涟水风电": 102000344,
    "华能灌云风电": 102000345,
    "核源睢宁风电": 102000346,
    "国投泗洪光伏": 102000347,
    "三峡泗洪光伏": 102000348,
    "广核泗洪光伏": 102000349,
    "华能泗洪光伏": 102000350,
    "鑫能镇江光伏": 102000351,
    "广恒如海风电": 102000352,
    "永贯灌云光伏": 102000353,
    "鑫风灌云风电": 102000354,
    "益风灌云风电": 102000355,
    "远能泗洪风电": 102000356,
    "协鑫昌荣风电": 102000357,
    "国源柳堡风电": 102000358,
    "双创台海风电": 102000359,
    "大唐射阳风电": 102000360,
    "中电智慧风电": 102000361,
    "和泰睢宁风电": 102000362,
    "新天灌云风电": 102000363,
    "苏交控如海风电": 102000364,
    "国信新洋风电": 102000365,
    "中电陈家港风电": 102000366,
    "亚洲金湖风电": 102000367,
    "博景楚州风电": 102000368,
    "广核涟水风电": 102000369,
    "华润楚州风电": 102000370,
    "深能小纪风电": 102000371,
    "深能甘垛风电": 102000372,
    "协鑫泗洪风电": 102000373,
    "协鑫睢宁风电": 102000374,
    "亚洲宝应风电": 102000375,
    "国湖新沂风电": 102000376,
    "优能邱集风电": 102000377,
    "深能涟水风电": 102000378,
    "广核淮阴风电": 102000379,
    "深能八义集风电": 102000380,
    "华电大仪风电": 102000381,
    "国源鲁垛风电": 102000382,
    "国信淮安风电": 102000383,
    "尚风灌云风电": 102000384,
    "华润高邮风电": 102000385,
    "深能临泽风电": 102000386,
    "华电沙沟风电": 102000387,
    "融保达安丰风电": 102000388,
    "融保达龙虬风电": 102000389,
    "戴莫金湖风电": 102000390,
    "深能刘老庄风电": 102000391,
    "润农淮安风电": 102000392,
    "深能射阳湖风电": 102000393,
    "华电陈集风电": 102000394,
    "中恒钦工风电": 102000395,
    "龙源射海风电": 102000396,
    "海新金湖风电": 102000397,
    "奇力淮阴风电": 102000398,
    "嘉鑫淮阴风电": 102000399,
    "融保达汤庄风电": 102000400,
    "大唐金湖风电": 102000401,
    "大唐宝应风电": 102000402,
    "协鑫合沟风电": 102000403,
    "海宇淮阴风电": 102000404,
    "核源梁集风电": 102000405,
    "飞展百禄光伏": 102000406,
    "国顺金湖风电": 102000407,
    "协鑫武坚风电": 102000408,
    "国润金湖风电": 102000409,
    "海宇鲁垛风电": 102000410,
    "大唐吕四港光伏": 102000411,
    "博润蒋海风电": 102000412,
    "蒙能灌云风电": 102000413,
    "海翔如海风电": 102000414,
    "和风如海风电": 102000415,
    "国信如海风电": 102000416,
    "华威东海风电": 102000417,
    "华尔锐启海风电": 102000418,
    "华威启海风电": 102000419,
    "协鑫如海风电": 102000420,
    "润风金湖风电": 102000421,
    "绿谷峡如风电": 102000422,
    "绿谷峡通风电": 102000423,
    "华润睢宁风电": 102000424,
    "华能射海风电": 102000425,
    "华润邳州风电": 102000426,
    "国丰丰海风电": 102000427,
    "绿谷广核风电": 102000428,
    "毛竹沙风电": 102000429,
    "智鑫如海风电": 102000430,
    "龙源亮海风电": 102000431,
    "龙源平海风电": 102000432,
    "协鑫阜宁风电": 102000433,
    "沿海灌云光伏": 102000434,
    "汇智射阳风电": 102000435,
    "华润徐舍风电": 102000436,
    "帷瑞丹阳光伏": 102000437,
    "中电杨巷风电": 102000438,
    "汇能金湖风电": 102000439,
    "九金前黄风电": 102000441,
    "绿动灌云风电": 102000442,
    "国华徐厂光伏": 102000443,
    "常州电厂光伏": 102000444,
    "谏壁电厂光伏": 102000445,
    "高港电厂光伏": 102000446,
    "航天如东风电": 102000447,
    "陈家港电厂光伏": 102000448,
    "国电宿厂光伏": 102000449,
    "中电杨巷光伏": 102000500,
    "通威如东光伏": 102000501,
    "源宇古桑风电": 102000502,
    "杰尊公道光伏": 102000503,
    "国电投月厂光伏": 102000504,
    "安丰金湖风电": 102000505,
    "安晟金湖风电": 102000506,
    "东磁泗洪光伏": 102000507,
    "句容电厂光伏": 102000508,
    "巷阳方巷光伏": 102000509,
    "华能如东光伏": 102000511,
    "北清鲁垛光伏": 102000512,
    "名湖泗阳光伏": 102000513,
    "东磁泗洪光伏_峰山虚拟": 102000514,
    "广核如东光伏": 102000515,
    "华能新建光伏": 102000516,
    "华润如东光伏": 102000517,
    "大唐睢宁光伏": 102000518,
    "华润高邮光伏": 102000519,
    "华电墩尚光伏": 102000521,
    "沪彭榆庄光伏": 102000522,
    "中电建洋口光伏": 102000523,
    "华电小纪光伏": 102000524,
    "旭强响水光伏": 103000001
}

station_name_to_type = {

}

# district_id 映射规则
district_id_mapping = {
    1: 1,
    2: 3,
    3: 4,
    4: 5,
    5: 2,
    6: 9,
    7: 13,
    8: 12,
    9: 10,
    10: 7,
    11: 6,
    12: 8,
    13: 11
}

# 连接数据库
conn2 = psycopg2.connect(**pg_config2)
cur2 = conn2.cursor()

# 从A表读取数据
cur2.execute("SELECT id, station_name, station_type, station_abbr, city_code, plan_capacity, ongrid_capacity, access_time, longitude, latitude FROM station_info")
rows = cur2.fetchall()
cur2.close()
conn2.close()

conn = psycopg2.connect(**pg_config)
cur = conn.cursor()
# 插入到B表
for row in rows:
    _, name, station_type, abbr, city_code, planning_capacity, capacity, create_time, longitude, latitude = row

    station_id = station_name_to_id.get(name, None)
    if station_id is None:
        continue  # 跳过未匹配的station_name

    district_id = district_id_mapping.get(city_code, None)
    margin = 0.02
    switch_agc = True
    clique = None
    remark = None
    creator = 1
    updater = None
    update_time = None
    delete_flag = False

    cur.execute("""
        INSERT INTO power_station (
            station_id, name, abbr, station_type, district_id, planning_capacity, capacity, margin,
            switch_agc, clique, longitude, latitude, remark, creator, updater, create_time, update_time, delete_flag
        ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
    """, (
        station_id, name, abbr, station_type, district_id, planning_capacity, capacity, margin,
        switch_agc, clique, longitude, latitude, remark, creator, updater, create_time, update_time, delete_flag
    ))

# 提交事务
conn.commit()

# 关闭连接
cur.close()
conn.close()
